Центр_управления_производительностью_демо/src/Enums/СостоянияБлокировок/СостоянияБлокировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияБлокировок</name>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>Преобразование</name>
  </enumValues>
  <enumValues>
    <name>Установлена</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Enums/ТипыРесурсов/ТипыРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРесурсов</name>
  <enumValues>
    <name>ОбъектМетаданных</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>Индекс</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Enums/ТипыВыполненийКода/ТипыВыполненийКода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВыполненийКода</name>
  <enumValues>
    <name>СерверныйВызов</name>
  </enumValues>
  <enumValues>
    <name>УстановкаБлокировки</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Documents/Блокировка/Блокировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Блокировка</name>
  <attributes>
    <name>ВыполнениеЗапроса</name>
    <type>
      <types>DocumentRef.ВыполнениеКода</types>
      <types>DocumentRef.ВыполнениеЗапроса</types>
    </type>
  </attributes>
  <attributes>
    <name>Гранулярность</name>
    <type>
      <types>EnumRef.ВидыГранулярностиБлокировок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Режим</name>
    <type>
      <types>EnumRef.РежимыБлокировок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресурс</name>
    <comment>Заблокированный ресурс</comment>
    <type>
      <types>CatalogRef.Ресурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияБлокировок</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Центр_управления_производительностью_демо/src/Documents/ВыполнениеКода/ВыполнениеКода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеКода</name>
  <attributes>
    <name>ВремяВыполненияМс</name>
    <comment>Время выполнения запроса (милисекунд)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписаноДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтекстСсылка</name>
    <type>
      <types>CatalogRef.Контексты</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРасходПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МоментВремениОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемНеосвобожденнойПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИБ</name>
    <type>
      <types>CatalogRef.ПользователиИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Соединение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчитаноДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыполнения</name>
    <type>
      <types>EnumRef.ТипыВыполненийКода</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешКонтекста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Центр_управления_производительностью_демо/src/Documents/ВыполнениеЗапроса/ВыполнениеЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеЗапроса</name>
  <attributes>
    <name>ВесПланаЗапроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияМс</name>
    <comment>Время выполнения запроса (милисекунд)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>CatalogRef.Запросы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтекстСсылка</name>
    <type>
      <types>CatalogRef.Контексты</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментВремениОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>План</name>
    <type>
      <types>CatalogRef.ПланыЗапросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИБ</name>
    <type>
      <types>CatalogRef.ПользователиИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Соединение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>CatalogRef.ТекстыЗапросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Центр_управления_производительностью_демо/src/CommonForms/АнализВыполнений/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.ДокументВыполнения) Тогда
		Сообщить("Не указан документ выполнения!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	ДокументВыполнения = Параметры.ДокументВыполнения;
	
	ЗаполнитьДанныеФормы();
	ЗаполнитьТаблицуБлокировок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ПараметрыЗапроса", ПараметрыЗапроса);
	ОткрытьФорму("ОбщаяФорма.ПросмотрТекста", 
		ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура заполняет таблицу блокировок.
//
Процедура ЗаполнитьТаблицуБлокировок()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА Блокировка.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБлокировок.Ожидание)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ИндексКартинки,
	               |	Блокировка.Ссылка КАК Ссылка,
	               |	Блокировка.Дата КАК Дата,
	               |	Блокировка.Гранулярность КАК Гранулярность,
	               |	Блокировка.ИдентификаторРесурса КАК ИдентификаторРесурса,
	               |	Блокировка.МоментВремени КАК МоментВремени,
	               |	Блокировка.Режим КАК Режим,
	               |	Блокировка.Ресурс КАК Ресурс,
	               |	Блокировка.Состояние КАК Состояние,
	               |	ВЫБОР
	               |		КОГДА Блокировка.Ресурс.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыРесурсов.ОбъектМетаданных)
	               |			ТОГДА Блокировка.Ресурс
	               |		КОГДА Блокировка.Ресурс.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыРесурсов.Таблица)
	               |			ТОГДА Блокировка.Ресурс.Родитель
	               |		КОГДА Блокировка.Ресурс.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыРесурсов.Индекс)
	               |			ТОГДА Блокировка.Ресурс.Родитель.Родитель
	               |	КОНЕЦ КАК ОбъектМетаданных,
	               |	0 КАК ИндексКартинкиОбъектМетаданных
	               |ИЗ
	               |	Документ.Блокировка КАК Блокировка
	               |ГДЕ
	               |	Блокировка.ВыполнениеЗапроса = &ДокументВыполнения";
	
	Запрос.УстановитьПараметр("ДокументВыполнения", ДокументВыполнения);
	
	ТаблицаБлокировок = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтр Из ТаблицаБлокировок Цикл
		ТекСтр.ИндексКартинкиОбъектМетаданных = СтруктураМетаданных.ПолучитьИндексКартинки(ТекСтр.ОбъектМетаданных);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаБлокировок, "Блокировки");
	
КонецПроцедуры // ЗаполнитьТаблицуБлокировок()

// Процедура заполняет данные формы.
//
Процедура ЗаполнитьДанныеФормы()
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ДокументВыполнения) = Тип("ДокументСсылка.ВыполнениеКода") Тогда
		
		// Запрос выбора данных документа Выполнение
		Запрос.Текст = "ВЫБРАТЬ
		               |	Выполнение.Ссылка КАК Ссылка,
		               |	Выполнение.Дата КАК Дата,
		               |	Выполнение.ВремяВыполненияМс КАК ВремяВыполненияМс,
		               |	Выполнение.МоментВремениОкончания КАК МоментВремениОкончания,
		               |	Выполнение.ПользовательИБ КАК ПользовательИБ,
		               |	Выполнение.Контекст КАК Контекст
		               |ИЗ
		               |	Документ.ВыполнениеКода КАК Выполнение
		               |ГДЕ
		               |	Выполнение.Ссылка = &ДокументВыполнения";
		
	Иначе
		
		// Запрос выбора данных документа ВыполнениеЗапроса
		Запрос.Текст = "ВЫБРАТЬ
		               |	Выполнение.Ссылка КАК Ссылка,
		               |	Выполнение.Дата КАК Дата,
		               |	Выполнение.ВремяВыполненияМс КАК ВремяВыполненияМс,
		               |	Выполнение.МоментВремениОкончания КАК МоментВремениОкончания,
		               |	Выполнение.ПользовательИБ КАК ПользовательИБ,
		               |	Выполнение.Контекст КАК Контекст,
		               |	Выполнение.ТекстЗапроса.Текст КАК Текст,
		               |	Выполнение.ТекстЗапроса.МетаТекст КАК МетаТекст,
		               |	Выполнение.План.Текст КАК План,
		               |	Выполнение.План.ТипСУБД КАК ТипСУБД,
		               |	Выполнение.ПараметрыЗапроса КАК ПараметрыЗапроса
		               |ИЗ
		               |	Документ.ВыполнениеЗапроса КАК Выполнение
		               |ГДЕ
		               |	Выполнение.Ссылка = &ДокументВыполнения";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументВыполнения", ДокументВыполнения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Заполнить данные формы
	Пока Выборка.Следующий() Цикл
		
		ВремяВыполненияМс      = Выборка.ВремяВыполненияМс;
		Время                  = Выборка.Дата;
		МоментВремениОкончания = Выборка.МоментВремениОкончания;
		ПользовательИБ         = Выборка.ПользовательИБ;
		КонтекстВыполнения.УстановитьТекст(Выборка.Контекст);
		
		Если ТипЗнч(ДокументВыполнения) = Тип("ДокументСсылка.ВыполнениеЗапроса") Тогда
			
			ТекстПлана = АнализЗапросов.ОформитьПлан(Выборка.План, Выборка.ТипСУБД);
			ПланЗапроса.УстановитьТекст(ТекстПлана);
			ЗапросSQL.УстановитьТекст(Выборка.Текст);
			ЗапросSDBL.УстановитьТекст(Выборка.МетаТекст);
			ПараметрыЗапроса = Выборка.ПараметрыЗапроса;
			ПредставлениеПараметровЗапроса = СтрЗаменить(ПараметрыЗапроса, Символы.ПС, ", ");
			ПредставлениеПараметровЗапроса = ?(
				Прав(ПредставлениеПараметровЗапроса, 2) = ", ",
				Лев(ПредставлениеПараметровЗапроса, СтрДлина(ПредставлениеПараметровЗапроса) - 2),
				ПредставлениеПараметровЗапроса
			);
			ЭтотОбъект.Заголовок = "Выполнение запроса";
		Иначе
			ЭтотОбъект.Заголовок = "Выполнение кода конфигурации";
			Элементы.СтраницаЗапрос.Видимость = Ложь;
			Элементы.СтраницаПлан.Видимость = Ложь;
			Если ДокументВыполнения.ТипВыполнения = Перечисления.ТипыВыполненийКода.СерверныйВызов Тогда
				Элементы.СтраницаБлокировки.Видимость = Ложь;
			КонецЕсли;
			Элементы.БлокировкиИдентификаторРесурса.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДанныеФормы();

&НаКлиенте
Процедура БлокировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Блокировки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле.Имя = "БлокировкиРесурс" И ЗначениеЗаполнено(ДанныеСтроки.Ресурс) Тогда
		ПоказатьЗначение(, ДанныеСтроки.Ресурс);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ДанныеСтроки.Ссылка);
		ФормаДокумента = ПолучитьФорму("Документ.Блокировка.ФормаОбъекта", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	
КонецПроцедуры
